{
    "version": "https://jsonfeed.org/version/1",
    "title": "No puedes escapar",
    "description": "",
    "home_page_url": "https://ssayima.github.io/escapar",
    "feed_url": "https://ssayima.github.io/escapar/feed.json",
    "user_comment": "",
    "author": {
        "name": "xxmo"
    },
    "items": [
        {
            "id": "https://ssayima.github.io/escapar/first-meeting.html",
            "url": "https://ssayima.github.io/escapar/first-meeting.html",
            "title": "First meeting",
            "summary": "What the fuck are you(me) doing here? How can anyone take you seriously? You have no coding skills yet here you are talking about how you hope that by the end of six months you’re hoping to have learned about IPFS, the Lightning Network and&hellip;",
            "content_html": "<p class=\"p1\"><span class=\"s1\">What the fuck are you(me) doing here? How can anyone take you seriously? You have no coding skills yet here you are talking about how you hope that by the end of six months you’re hoping to have learned about IPFS, the Lightning Network and DIDs. Just what the actual fuck?!!</span></p>\n<p class=\"p1\"><span class=\"s1\">Sorry, my mind is not very PC but I am(or I try at least). But yeah, if someone could make a recording of what was going on in my mind thats what they would hear.</span></p>\n<p class=\"p1\"><span class=\"s1\">Anyway, the hour went by and this knowlegable guy who knew more about these things than I could ever dream from where I was standing was talking to me like an equal, not laughing at my dreams and reassuring me that its doable. Affirming that there is nothing wishful or delusional about me wanting to bridge the gap between where I am and where I am claimiing that I want to be.</span></p>\n<p class=\"p1\"><span class=\"s1\">Ohkay, we've established that he’s not a mosnter but far from it. He’s validating and encouring me. Now what? Apparently the only one who can stand between me and that dream is me. And that also has its own suckiness. </span></p>\n<p class=\"p1\"><span class=\"s1\">I have a guide. I have a plan . Can I do it? Or rather, will I do it?</span></p>\n<p class=\"p1\"><span class=\"s1\">Back up, back up, back up.</span></p>\n<p class=\"p1\"><span class=\"s1\">Lets look back at our past. This moment feels familiar. Where you have this mountain infront of you and you know for sure that the view looks good from the top, you make the first move but you give up too soon. What caused it then and what can we learn from it so it doesnt happen this time around?</span></p>\n<p class=\"p1\"><span class=\"s1\">I would say we took up too much. We made unrealistic goals, took on too much and crashed. </span></p>\n<p class=\"p1\"><span class=\"s1\">Okay, the only thing he said I need to do until we meet again is upload a pic on IPFS. But what does this overexcited mind want?</span></p>\n<p class=\"p1\"><span class=\"s1\">It wants to finish the entire freecodecamp Responsive Web Design &amp; JavaScript Algorithms and Data Structures course, start looking into IDX just to see how it relates with IPFS. And hopefully have done it all before the next meeting so that learning about the Lighting Network would be next step and he could give me guidance on where to start with that.</span></p>\n<p class=\"p1\"><span class=\"s1\">What the actual fuQ!!! </span></p>\n<p class=\"p1\"><span class=\"s1\">How did we go from an assigment of upload a picture on IPFS to demanding so much from myself??</span></p>\n<p class=\"p1\"><span class=\"s1\">What are 300 hours in days anyway? </span></p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://ssayima.github.io/escapar/media/posts/2/Screen-Shot-2021-06-14-at-5.43.32-PM.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://ssayima.github.io/escapar/media/posts/2/responsive/Screen-Shot-2021-06-14-at-5.43.32-PM-xs.png 300w ,https://ssayima.github.io/escapar/media/posts/2/responsive/Screen-Shot-2021-06-14-at-5.43.32-PM-sm.png 480w ,https://ssayima.github.io/escapar/media/posts/2/responsive/Screen-Shot-2021-06-14-at-5.43.32-PM-md.png 768w ,https://ssayima.github.io/escapar/media/posts/2/responsive/Screen-Shot-2021-06-14-at-5.43.32-PM-lg.png 1024w ,https://ssayima.github.io/escapar/media/posts/2/responsive/Screen-Shot-2021-06-14-at-5.43.32-PM-xl.png 1360w ,https://ssayima.github.io/escapar/media/posts/2/responsive/Screen-Shot-2021-06-14-at-5.43.32-PM-2xl.png 1600w\"  alt=\"\" width=\"942\" height=\"321\"></figure>\n<p class=\"p1\"><span class=\"s1\">(300/24= 12.5) 12 and a half days. Jesus christ, whats the plan girl? How do you plan to squeeze 12 and a half days, times two, into two weeks?</span></p>\n<p class=\"p1\"><span class=\"s1\">Well, I’m thinking I’m going to use only like 3 days for the Responsive Web Design course coz I already know some HTML and CSS and so this would be me brushing up on these things. Then I’ll use the remaining time on Javascript. If I could put six hours a day, I should get far enough to get ready to start looking into the Lightning Network.</span></p>\n<p class=\"p1\"><span class=\"s1\">Okay, what about IPFS? </span></p>\n<p class=\"p1\"><span class=\"s1\">It shouldn’t take more that a day to get started right?</span></p>\n<p class=\"p1\"><span class=\"s1\">And that ladies and gentlemen is the tumroil that is to live with my mind , welcome to my space.</span></p>\n<p class=\"p1\"><span class=\"s1\">I'm curious to see what happens two weeks later: How did I do?</span></p>\n<p class=\"p2\"> </p>",
            "author": {
                "name": "xxmo"
            },
            "tags": [
            ],
            "date_published": "2021-06-14T17:47:46+02:00",
            "date_modified": "2021-06-14T17:47:46+02:00"
        }
    ]
}
